//for zwLx.go 模块, 流化星曜;
package zwds

//流年与四化
var (
	化宫简名 = [13]string{
		"命", "父", "福", "宅", "官", "友", "迁", "疾", "财", "子", "配", "兄", "原"}
	流运名 = [6]string{
		"本命", "大运", "流年", "流月", "流日", "流时"}
	流运命宫 = [6]string{
		"命宫", "运命宫", "年命宫", "月命宫", "日命宫", "时命宫"}
	流干系 = [7]string{
		"禄", "魁", "钺", "羊", "陀", "昌", "曲"}
	化干系 = [4]string{
		"禄", "权", "科", "忌"}
	流支系 = [4]string{
		"马", "鸾", "喜", "解"}
	流干系表 = [10][7]int{
		// 流禄, 流魁, 流钺, 流羊, 流陀, 流昌, 流曲,
		{寅, 丑, 未, 卯, 丑, 巳, 酉}, //甲
		{卯, 子, 申, 辰, 寅, 午, 申}, //乙
		{巳, 亥, 酉, 午, 辰, 申, 午}, //丙
		{午, 亥, 酉, 未, 巳, 酉, 巳}, //丁
		{巳, 丑, 未, 午, 辰, 申, 午}, //戊
		{午, 子, 申, 未, 巳, 酉, 巳}, //己
		{申, 丑, 未, 酉, 未, 亥, 卯}, //庚
		{酉, 午, 寅, 戌, 申, 子, 寅}, //辛
		{亥, 卯, 巳, 子, 戌, 寅, 子}, //壬
		{子, 卯, 巳, 丑, 亥, 卯, 亥}} //癸 流干
	流支系表 = [12][4]int{
		//流马,流鸾,流喜,流解 流支
		{寅, 卯, 酉, 戌}, //子
		{亥, 寅, 申, 酉}, //丑
		{申, 丑, 未, 申}, //寅
		{巳, 子, 午, 未}, //卯
		{寅, 亥, 巳, 午}, //辰
		{亥, 戌, 辰, 巳}, //巳
		{申, 酉, 卯, 辰}, //午
		{巳, 申, 寅, 卯}, //未
		{寅, 未, 丑, 寅}, //申
		{亥, 午, 子, 丑}, //酉
		{申, 巳, 亥, 子}, //戌
		{巳, 辰, 戌, 亥}} //亥

	// 廉贞,天机,天同,太阴,贪狼,武曲,太阳,巨门,天梁,破军,化禄星
	// 破军,天梁,天机,天同,太阴,贪狼,武曲,太阳,紫微,巨门,化权星
	// 武曲,紫微,文昌,天机,右弼,天梁,太阴,文曲,左辅,太阴,化科星
	// 太阳,太阴,廉贞,巨门,天机,文曲,天同,文昌,武曲,贪狼,化忌星

	全书化干表 = [10][4]string{
		{"廉贞", "破军", "武曲", "太阳"}, //甲
		{"天机", "天梁", "紫微", "太阴"}, //乙
		{"天同", "天机", "文昌", "廉贞"}, //丙
		{"太阴", "天同", "天机", "巨门"}, //丁
		{"贪狼", "太阴", "右弼", "天机"}, //戊
		{"武曲", "贪狼", "天梁", "文曲"}, //己
		{"太阳", "武曲", "太阴", "天同"}, //庚
		{"巨门", "太阳", "文曲", "文昌"}, //辛
		{"天梁", "紫微", "左辅", "武曲"}, //壬
		{"破军", "巨门", "太阴", "贪狼"}} //癸
	// 化禄星,化权星,化科星,化忌星
	中州化干表 = [10][4]string{
		{"廉贞", "破军", "武曲", "太阳"}, //甲
		{"天机", "天梁", "紫微", "太阴"}, //乙
		{"天同", "天机", "文昌", "廉贞"}, //丙
		{"太阴", "天同", "天机", "巨门"}, //丁
		{"贪狼", "太阴", "太阳", "天机"}, //戊
		{"武曲", "贪狼", "天梁", "文曲"}, //己
		{"太阳", "武曲", "天府", "天同"}, //庚
		{"巨门", "太阳", "文曲", "文昌"}, //辛
		{"天梁", "紫微", "天府", "武曲"}, //壬
		{"破军", "巨门", "太阴", "贪狼"}} //癸
	//	中州戊干四化 = [4]string{"贪狼", "太阴", "太阳", "天机"}
	//	中州庚干四化 = [4]string{"太阳", "武曲", "天府", "天同"}
	//	中州壬干四化 = [4]string{"天梁", "紫微", "天府", "武曲"}

	岁前系  = [12]string{"岁建", "晦气", "丧门", "贯索", "官符", "小耗", "大耗", "龙德", "白虎", "天德", "吊客", "病符"}
	岁前系表 = [12][12]int{
		{子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥}, //子
		{丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子}, //丑
		{寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑}, //寅
		{卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑, 寅}, //卯
		{辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑, 寅, 卯}, //辰
		{巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑, 寅, 卯, 辰}, //巳
		{午, 未, 申, 酉, 戌, 亥, 子, 丑, 寅, 卯, 辰, 巳}, //午
		{未, 申, 酉, 戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午}, //未
		{申, 酉, 戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未}, //申
		{酉, 戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申}, //酉
		{戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉}, //戌
		{亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌}} //亥	  流年支
	//岁建, 晦气, 丧门, 贯索, 官符, 小耗, 大耗, 龙德, 白虎, 天德, 吊客, 病符
	将前系  = [12]string{"将星", "攀鞍", "岁驿", "息神", "华盖", "劫煞", "灾煞", "天煞", "指背", "咸池", "月煞", "亡神"}
	将前系表 = [4][12]int{
		{午, 未, 申, 酉, 戌, 亥, 子, 丑, 寅, 卯, 辰, 巳}, //寅午戌
		{子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥}, //申子辰
		{酉, 戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申}, //巳酉丑
		{卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑, 寅}} //亥卯未  流年支
	//将星,攀鞍,岁驿,息神,华盖,劫煞,灾煞,天煞,指背,咸池,月煞,亡神
	博士系 = [12]string{"博士", "力士", "青龙", "小耗", "将军", "奏书", "飞廉", "喜神", "病符", "大耗", "伏兵", "官符"}
	//博士星系由命盘上的禄存星所在宫打头，阳男阴女顺行，阴男阳女逆行，依次布下

	小限表 = [4][12]int{
		{辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑, 寅, 卯}, //寅午戌
		{戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉}, //申子辰
		{未, 申, 酉, 戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午}, //巳酉丑
		{丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子}} //亥卯未
	//小限表,生年支, 男顺女逆

	子年斗君表 = [12][12]int{
		{子, 亥, 戌, 酉, 申, 未, 午, 巳, 辰, 卯, 寅, 丑}, //子
		{丑, 子, 亥, 戌, 酉, 申, 未, 午, 巳, 辰, 卯, 寅}, //丑
		{寅, 丑, 子, 亥, 戌, 酉, 申, 未, 午, 巳, 辰, 卯}, //寅
		{卯, 寅, 丑, 子, 亥, 戌, 酉, 申, 未, 午, 巳, 辰}, //卯
		{辰, 卯, 寅, 丑, 子, 亥, 戌, 酉, 申, 未, 午, 巳}, //辰
		{巳, 辰, 卯, 寅, 丑, 子, 亥, 戌, 酉, 申, 未, 午}, //巳
		{午, 巳, 辰, 卯, 寅, 丑, 子, 亥, 戌, 酉, 申, 未}, //午
		{未, 午, 巳, 辰, 卯, 寅, 丑, 子, 亥, 戌, 酉, 申}, //未
		{申, 未, 午, 巳, 辰, 卯, 寅, 丑, 子, 亥, 戌, 酉}, //申
		{酉, 申, 未, 午, 巳, 辰, 卯, 寅, 丑, 子, 亥, 戌}, //酉
		{戌, 酉, 申, 未, 午, 巳, 辰, 卯, 寅, 丑, 子, 亥}, //戌
		{亥, 戌, 酉, 申, 未, 午, 巳, 辰, 卯, 寅, 丑, 子}} //亥 出生时
	//一,二,三,四,五,六,七,八,九,十,十一,十二 出生月
	//　　1,定子年斗君(查表),顺盘数至生年地支,为生年斗君，以后逐年斗君可顺盘而推，一年一宫。
	//　　2,起流月的规则：以斗君宫起正月(即命宫)，其余各流月顺盘而布，一月一宫。
	//	如为闰月,分半,归上下月;(也有不分按上一个月算法计算)
	//　　3,定流日：以流月所在的宫起初一(命宫)，顺行十二宫，一日一宫，到月底最后一天止。
	//　　4,定流时：在流日所在的宫上起子时，顺布十二宫，每一个时辰占一宫。

)
