//for zwX.go 模块, 主星
package zwds

//用于五行局表序号
const (
	水二局, 木三局, 金四局, 土五局, 火六局 = 0, 1, 2, 3, 4
)

// 用于宫位序号(1-12);
const (
	寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑 = 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12
)

var (
	// 对应宫干支,宫名, (1-12)
	宫名 = [13]string{
		"命宫", "父母", "福德", "田宅", "官禄", "仆役", "迁移", "疾厄", "财帛", "子女", "夫妻", "兄弟", "身宫"}
	宫支 = [12]string{
		"寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥", "子", "丑"}
	宫干 = [5][12]string{
		{"丙", "丁", "戊", "己", "庚", "辛", "壬", "癸", "甲", "乙", "丙", "丁"}, //甲 ,己
		{"戊", "己", "庚", "辛", "壬", "癸", "甲", "乙", "丙", "丁", "戊", "己"}, //乙 ,庚
		{"庚", "辛", "壬", "癸", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛"}, //丙 ,辛
		{"壬", "癸", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"}, //丁 ,壬
		{"甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸", "甲", "乙"}} //戊 ,癸 生年干
	命主星 = [12]string{
		"贪狼", "巨门", "禄存", "文曲", "廉贞", "武曲", "破军", "武曲", "廉贞", "文曲", "禄存", "巨门"}
	//命主用命宫年支, 身主用出生年支计算;
	身主星 = [12]string{
		"铃星", "天相", "天梁", "天同", "文昌", "天机", "火星", "天相", "天梁", "天同", "文昌", "天机"}
	子年斗君 = [12]string{"寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥", "子", "丑"}
	五行局  = [5]string{
		"水二局", "木三局", "金四局", "土五局", "火六局"}
	// 转换五行局数
	五行局表 = [5][3]int{
		//子丑午未,	寅卯申酉,辰巳戌亥;    	命宫支
		{金四局, 水二局, 火六局}, //甲、乙	命宫干
		{水二局, 火六局, 土五局}, //丙、丁
		{火六局, 土五局, 木三局}, //戊、己
		{土五局, 木三局, 金四局}, //庚、辛
		{木三局, 金四局, 水二局}} //壬、癸
	// 五行局数主用用于以下如紫微星的数组序列;

	紫微星 = "紫微"
	紫微表 = [5][30]int{
		//1日2日3日4日5日6日7日8日9日10日11日12日13日14日15日16日17日18日19日20日21日22日23日24日25日26日27日28日29日30日
		{丑, 寅, 寅, 卯, 卯, 辰, 辰, 巳, 巳, 午, 午, 未, 未, 申, 申, 酉, 酉, 戌, 戌, 亥, 亥, 子, 子, 丑, 丑, 寅, 寅, 卯, 卯, 辰}, //水
		{辰, 丑, 寅, 巳, 寅, 卯, 午, 卯, 辰, 未, 辰, 巳, 申, 巳, 午, 酉, 午, 未, 戌, 未, 申, 亥, 申, 酉, 子, 酉, 戌, 丑, 戌, 亥}, //木
		{亥, 辰, 丑, 寅, 子, 巳, 寅, 卯, 丑, 午, 卯, 辰, 寅, 未, 辰, 巳, 卯, 申, 巳, 午, 辰, 酉, 午, 未, 巳, 戌, 未, 申, 午, 亥}, //金
		{午, 亥, 辰, 丑, 寅, 未, 子, 巳, 寅, 卯, 申, 丑, 午, 卯, 辰, 酉, 寅, 未, 辰, 巳, 戌, 卯, 申, 巳, 午, 亥, 辰, 酉, 午, 未}, //土
		{酉, 午, 亥, 辰, 丑, 寅, 戌, 未, 子, 巳, 寅, 卯, 亥, 申, 丑, 午, 卯, 辰, 子, 酉, 寅, 未, 辰, 巳, 丑, 戌, 卯, 申, 巳, 午}} //火

	紫府系  = [13]string{"天机", "太阳", "武曲", "天同", "廉贞", "天府", "太阴", "贪狼", "巨门", "天相", "天梁", "七杀", "破军"}
	紫府系表 = [12][13]int{
		//天机, 太阳, 武曲, 天同, 廉贞, 天府, 太阴, 贪狼, 巨门, 天相, 天梁, 七杀, 破军
		{丑, 亥, 戌, 酉, 午, 寅, 卯, 辰, 巳, 午, 未, 申, 子}, //寅
		{寅, 子, 亥, 戌, 未, 丑, 寅, 卯, 辰, 巳, 午, 未, 亥}, //卯
		{卯, 丑, 子, 亥, 申, 子, 丑, 寅, 卯, 辰, 巳, 午, 戌}, //辰
		{辰, 寅, 丑, 子, 酉, 亥, 子, 丑, 寅, 卯, 辰, 巳, 酉}, //巳
		{巳, 卯, 寅, 丑, 戌, 戌, 亥, 子, 丑, 寅, 卯, 辰, 申}, //午
		{午, 辰, 卯, 寅, 亥, 酉, 戌, 亥, 子, 丑, 寅, 卯, 未}, //未
		{未, 巳, 辰, 卯, 子, 申, 酉, 戌, 亥, 子, 丑, 寅, 午}, //申
		{申, 午, 巳, 辰, 丑, 未, 申, 酉, 戌, 亥, 子, 丑, 巳}, //酉
		{酉, 未, 午, 巳, 寅, 午, 未, 申, 酉, 戌, 亥, 子, 辰}, //戌
		{戌, 申, 未, 午, 卯, 巳, 午, 未, 申, 酉, 戌, 亥, 卯}, //亥
		{亥, 酉, 申, 未, 辰, 辰, 巳, 午, 未, 申, 酉, 戌, 寅}, //子
		{子, 戌, 酉, 申, 巳, 卯, 辰, 巳, 午, 未, 申, 酉, 丑}} //丑 紫微宫位

	月系  = [8]string{"左辅", "右弼", "天刑", "天姚", "阴煞", "月解", "天巫", "天月"}
	月系表 = [12][8]int{
		//左辅,右弼,天刑,天姚,阴煞,月解,天巫,天月
		{辰, 戌, 酉, 丑, 寅, 申, 巳, 戌}, //一月
		{巳, 酉, 戌, 寅, 子, 申, 申, 巳}, //二月
		{午, 申, 亥, 卯, 戌, 戌, 亥, 辰}, //三月
		{未, 未, 子, 辰, 申, 戌, 寅, 寅}, //四月
		{申, 午, 丑, 巳, 午, 子, 巳, 未}, //五月
		{酉, 巳, 寅, 午, 辰, 子, 申, 卯}, //六月
		{戌, 辰, 卯, 未, 寅, 寅, 亥, 亥}, //七月
		{亥, 卯, 辰, 申, 子, 寅, 寅, 未}, //八月
		{子, 寅, 巳, 酉, 戌, 辰, 巳, 寅}, //九月
		{丑, 丑, 午, 戌, 申, 辰, 申, 午}, //十月
		{寅, 子, 未, 亥, 午, 午, 亥, 戌}, //十一月
		{卯, 亥, 申, 子, 辰, 午, 寅, 寅}} //十二月 出生月

	日系 = [4]string{"三台", "八座", "恩光", "天贵"}
	// 安三台星：由左辅星所在宫位上起初一日，沿十二宫顺时针方向数，数至出生日止，即在此宫安三台星
	// 安八座星：由右弼星所在宫位上起初一日，沿十二宫逆时针方向数，数至出生日止，即在此宫安八座星
	// 安天贵星：由文曲星所在宫位上起初一日，顺时针方向数，数至出生日宫再退回一宫，即在此宫安天贵星
	// 安恩光星：由文昌星所在宫位上起初一日,顺时针方向数，数至出生日宫再退回一宫，即在此宫安恩光星

	时系  = [6]string{"文昌", "文曲", "地空", "地劫", "台辅", "封诰"}
	时系表 = [12][6]int{
		//文昌,文曲,天空,地劫,台辅,封诰
		{戌, 辰, 亥, 亥, 午, 寅}, //子
		{酉, 巳, 戌, 子, 未, 卯}, //丑
		{申, 午, 酉, 丑, 申, 辰}, //寅
		{未, 未, 申, 寅, 酉, 巳}, //卯
		{午, 申, 未, 卯, 戌, 午}, //辰
		{巳, 酉, 午, 辰, 亥, 未}, //巳
		{辰, 戌, 巳, 巳, 子, 申}, //午
		{卯, 亥, 辰, 午, 丑, 酉}, //未
		{寅, 子, 卯, 未, 寅, 戌}, //申
		{丑, 丑, 寅, 申, 卯, 亥}, //酉
		{子, 寅, 丑, 酉, 辰, 子}, //戌
		{亥, 卯, 子, 戌, 巳, 丑}} //亥 出生时

	年支系 = [19]string{
		"天马", "红鸾", "天喜", "年解", "天哭", "天虚", "孤辰", "寡宿", "龙池", "凤阁",
		"蜚蠊", "破碎", "天空", "华盖", "咸池", "劫煞", "天德", "月德", "大耗"}
	年支系表 = [12][19]int{
		//天马,红鸾,天喜,年解,天哭,天虚,孤辰,寡宿,龙池,凤阁,蜚蠊,破碎,天空,华盖,咸池,劫煞,天德,月德,大耗;
		{寅, 卯, 酉, 戌, 午, 午, 寅, 戌, 辰, 戌, 申, 巳, 丑, 辰, 酉, 巳, 酉, 巳, 未}, //子
		{亥, 寅, 申, 酉, 巳, 未, 寅, 戌, 巳, 酉, 酉, 丑, 寅, 丑, 午, 寅, 戌, 午, 午}, //丑
		{申, 丑, 未, 申, 辰, 申, 巳, 丑, 午, 申, 戌, 酉, 卯, 戌, 卯, 亥, 亥, 未, 酉}, //寅
		{巳, 子, 午, 未, 卯, 酉, 巳, 丑, 未, 未, 巳, 巳, 辰, 未, 子, 申, 子, 申, 申}, //卯
		{寅, 亥, 巳, 午, 寅, 戌, 巳, 丑, 申, 午, 午, 丑, 巳, 辰, 酉, 巳, 丑, 酉, 亥}, //辰
		{亥, 戌, 辰, 巳, 丑, 亥, 申, 辰, 酉, 巳, 未, 酉, 午, 丑, 午, 寅, 寅, 戌, 戌}, //巳
		{申, 酉, 卯, 辰, 子, 子, 申, 辰, 戌, 辰, 寅, 巳, 未, 戌, 卯, 亥, 卯, 亥, 丑}, //午
		{巳, 申, 寅, 卯, 亥, 丑, 申, 辰, 亥, 卯, 卯, 丑, 申, 未, 子, 申, 辰, 子, 子}, //未
		{寅, 未, 丑, 寅, 戌, 寅, 亥, 未, 子, 寅, 辰, 酉, 酉, 辰, 酉, 巳, 巳, 丑, 卯}, //申
		{亥, 午, 子, 丑, 酉, 卯, 亥, 未, 丑, 丑, 亥, 巳, 戌, 丑, 午, 寅, 午, 寅, 寅}, //酉
		{申, 巳, 亥, 子, 申, 辰, 亥, 未, 寅, 子, 子, 丑, 亥, 戌, 卯, 亥, 未, 卯, 巳}, //戌
		{巳, 辰, 戌, 亥, 未, 巳, 寅, 戌, 卯, 亥, 丑, 酉, 子, 未, 子, 申, 申, 辰, 辰}} //亥 生年支

	年支五星 = [5]string{"天殇", "天使", "天才", "天寿", "龙德"}
	// 安天才星: 由命宫起子年，沿十二宫顺时针方向数，数至出生年支所在宫止，即在此宫安天才星
	// 安天寿星: 由身宫起子年，沿十二宫顺时针方向数，数至出生年支所在宫止，即在此宫安天寿星
	// 安龙德星: 由未宫起子年, 沿十二宫顺时针方向数，数至出生年支所在宫止，即在此宫安龙德星
	// 安天殇,天使星：天殇星固定在仆役宫，天使星固定在疾厄宫

	年干系  = [10]string{"禄存", "天魁", "天钺", "擎羊", "陀罗", "天官", "天福", "天厨", "截空", "副截"}
	年干系表 = [10][10]int{
		// 禄存, 天魁, 天钺, 擎羊, 陀罗, 天官, 天福, 天厨, 截空, 副截(即为截空)
		{寅, 丑, 未, 卯, 丑, 未, 酉, 巳, 申, 酉}, //甲
		{卯, 子, 申, 辰, 寅, 辰, 申, 午, 未, 午}, //乙
		{巳, 亥, 酉, 午, 辰, 巳, 子, 子, 辰, 巳}, //丙
		{午, 亥, 酉, 未, 巳, 寅, 亥, 巳, 卯, 寅}, //丁
		{巳, 丑, 未, 午, 辰, 卯, 卯, 午, 子, 丑}, //戊
		{午, 子, 申, 未, 巳, 酉, 寅, 申, 酉, 申}, //己
		{申, 丑, 未, 酉, 未, 亥, 午, 寅, 午, 未}, //庚
		{酉, 午, 寅, 戌, 申, 酉, 巳, 午, 巳, 辰}, //辛
		{亥, 卯, 巳, 子, 戌, 戌, 午, 酉, 寅, 卯}, //壬
		{子, 卯, 巳, 丑, 亥, 午, 巳, 亥, 丑, 子}} //癸 生年干

	旬空系 = [2]string{"旬空", "副旬"}
	旬空表 = [10][12]int{
		//子,丑,寅,卯,辰,巳,午,未,申,酉,戌,亥	生年支
		{戌, 0, 子, 0, 寅, 0, 辰, 0, 午, 0, 申, 0}, //甲 生年干
		{0, 亥, 0, 丑, 0, 卯, 0, 巳, 0, 未, 0, 酉}, //乙
		{申, 0, 戌, 0, 子, 0, 寅, 0, 辰, 0, 午, 0}, //丙
		{0, 酉, 0, 亥, 0, 丑, 0, 卯, 0, 巳, 0, 未}, //丁
		{午, 0, 申, 0, 戌, 0, 子, 0, 寅, 0, 辰, 0}, //戊
		{0, 未, 0, 酉, 0, 亥, 0, 丑, 0, 卯, 0, 巳}, //己
		{辰, 0, 午, 0, 申, 0, 戌, 0, 子, 0, 寅, 0}, //庚
		{0, 巳, 0, 未, 0, 酉, 0, 亥, 0, 丑, 0, 卯}, //辛
		{寅, 0, 辰, 0, 午, 0, 申, 0, 戌, 0, 子, 0}, //壬
		{0, 卯, 0, 巳, 0, 未, 0, 酉, 0, 亥, 0, 丑}} //癸

	火铃系 = [2]string{"火星", "铃星"}
	火星表 = [4][12]int{
		//子,丑,寅,卯,辰,巳,午,未,申,酉,戌,亥		  			  出生时
		{丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子}, //寅午戌
		{寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑}, //申子辰
		{卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑, 寅}, //巳酉丑
		{酉, 戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申}} //亥卯未 生年支

	铃星表 = [4][12]int{
		//子,丑,寅,卯,辰,巳,午,未,申,酉,戌,亥					  出生时
		{卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥, 子, 丑, 寅}, //寅午戌
		{戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉}, //申子辰
		{戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉}, //巳酉丑
		{戌, 亥, 子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉}} //亥卯未 生年支

	//长生落宫由五行局确定：金长生在巳，木长生在亥，火长生在寅，水土长生在申。由长生宫起头，男顺女逆，依次安
	长生系 = [12]string{"长生", "沐浴", "冠带", "临官", "帝旺", "衰", "病", "死", "墓", "绝", "胎", "养"}

	大限表 = [5][12]string{
		{"02---11", "12---21", "22---31", "32---41", "42---51", "52---61", "62---71", "72---81", "82---91", "92--101", "102-111", "112-121"}, //水二局
		{"03---12", "13---22", "23---32", "33---42", "43---52", "53---62", "63---72", "73---82", "83---92", "93--102", "103-112", "113-122"}, //木三局
		{"04---13", "14---23", "24---33", "34---43", "44---53", "54---63", "64---73", "74---83", "84---93", "94--103", "104-113", "114-123"}, //金四局
		{"05---14", "15---24", "25---34", "35---44", "45---54", "55---64", "65---74", "75---84", "85---94", "95--104", "105-114", "115-124"}, //土五局
		{"06---15", "16---25", "26---35", "36---45", "46---55", "56---65", "66---75", "76---85", "86---95", "96--105", "106-115", "116-125"}} //火六局
	//大限,由命宫为起点，根据五行局, 阳男阴女顺行，阴男阳女逆行，每一宫管十年
) // 以上为本命盘的安星; 其他为流年大运的安星,会随时间变化;
